<a href="https://colab.research.google.com/github/rishadb/sample_codes/blob/main/mySQL_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## API(authentication, CRUD, validation, Documentation), alembic, postman, testing, deployment(ubuntu, heroku), docker, ci/cd pipeline using github actions, Fastapi, postgres, sqlAlchemy
10:25:00 issue was in inheritance from PostBase instead of BaseModel.

In [ ]:
CREATE DATABASE dbName; USE dbName;
CREATE TABLE studs (
    id INT AUTO_INCREMENT,
    name VARCHAR(30) NOT NULL,
    mob INT UNIQUE,
    major VARCHAR(20) DEFAULT "Undecided",
    PRIMARY KEY(id)
);
DESCRIBE studs;
DROP TABLE STUDS;
SELECT * FROM studs;

-- <, >, <=, >=, =, <>, AND, OR
-- INT, DECIMAL(m,n),VARCHAR(l), BLOB, DATE, TIMESTAMP 
#INSERT
INSERT INTO studs VALUES(13,'Jack',8321, "Biology");
INSERT INTO studs VALUES('Jacky',882, "Sociology"); -- this fails coz id not given, but the below line works w/o id
INSERT INTO studs(name) VALUES('Mack'), ('wack') returning *; -- CAPS DONT MATTER , order of col and vals matters, returing return the change in table

#UPDATE
UPDATE studs
SET MAJOR = "Bio", major = "General"
WHERE MAJOR = 'Biology' OR NAME = "jaCky" RETURNING name; -- here capitals doesn't matter, also w/o WHERE all col vals are set to given val

#DELETE
DELETE FROM studs
WHERE name = "Mack" AND mob = null returning *; -- w/o WHERE, deletes whole table data
ALTER TABLE studs ADD age INT;

#QUERYING
SELECT name AS student_Name, studS.major, COUNT(Name), AVG(age)  -- funs- SUM, 
FROM stuDS 
WHERE major = "Bio" AND id<=3 OR name <> "jack" AND name IN ('CLaire', 'Jack', 'Mack') OR name NOT LIKE 'Cla%'
ORDER BY major DESC, ID DESC
LIMIT 2 OFFSET 1; #offfset ignore the first mentioned num of raws 

SELECT COUNT(id), id FROM studs ; -- count names, grup


SELECT DISTINCT major FROM studs; --gives unique values in major column



#multiple tables

CREATE TABLE Employee(
    Emp_id INT PRIMARY KEY, first_name VARCHAR(20),last_name VARCHAR(20),birth_day DATE,sex VARCHAR(1),salary INT,super_id INT,branch_id INT
);

#ALTER TABLE SCHEMA
ALTER TABLE Employee
ADD FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL,
ADD FOREIGN KEY(super_id) REFERENCES employee(Emp_id)ON DELETE SET NULL,
ADD age INT; -- adds colum age into the table

CREATE TABLE branch (
    branch_id INT PRIMARY KEY, branch_name VARCHAR(20), mgr_id INT, mgr_start_date DATE,
    FOREIGN KEY(mgr_id) REFERENCES Employee(Emp_id) ON DELETE SET NULL
);

CREATE TABLE client (client_id INT PRIMARY KEY, client_name VARCHAR(30), branch_id INT,
FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL);

CREATE TABLE works_with(emp_id INT, client_id INT, total_sales INT, PRIMARY KEY(emp_id, client_id), 
FOREIGN KEY(emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE, FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE);

CREATE TABLE branch_supplier(branch_id INT, supplier_name VARCHAR(20), supply_type VARCHAR(20), PRIMARY KEY(branch_id, supplier_name),
FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE);

DROP TABLE branch_supplier;

SyntaxError: ignored